"1 187 1 4206624770 ,"
"input 1 3 256 256 ,"
" 208 209 212 230 231 232 234 236 237 238 239 243 261 262 263 265 267 268 269 270 271 272 300 303 321 322 323 325 327 328 329 330 334 352 353 354 356 358 359 360 361 362 363 366 384 385 386 388 390 391 392 393 397 415 416 417 419 421 422 423 424 425 426 454 457 475 476 477 479 481 482 483 484 487 505 506 507 509 511 512 513 514 518 536 537 538 540 542 543 544 545 546 547 575 578 596 597 598 600 602 603 604 605 608 626 627 628 630 632 633 634 635 639 657 658 659 661 663 664 665 666 667 668 696 699 717 718 719 721 723 724 725 726 729 747 748 749 751 753 754 755 756 760 778 779 780 782 784 785 786 787 788 789 817 820 838 839 840 842 844 845 846 847 850 868 869 870 872 874 875 876 877 881 899 900 901 903 905 906 907 908 909 910 911 912 input output ,"
"output ,"
" 186 ,"
"Upsample 208 1 1 input 208 1 0 0 0 8 8 ,"
"Convolution 209 1 1 208 209 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"BatchNormCxx 212 1 1 209 212 ,"
"Upsample 230 1 1 input 230 1 0 0 0 8 8 ,"
"Convolution 231 1 1 230 231 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 232 1 1 231 232 ,"
"Convolution 236 1 1 232 236 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 234 1 1 232 234 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 237 2 1 212 236 237 ,"
"Add 238 2 1 237 234 238 ,"
"PReLU 239 1 1 238 239 1 0 ,"
"Convolution 243 1 1 239 243 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 261 1 1 input 261 1 0 0 0 8 8 ,"
"Convolution 262 1 1 261 262 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 263 1 1 262 263 ,"
"Convolution 267 1 1 263 267 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 265 1 1 263 265 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 268 2 1 243 267 268 ,"
"Add 269 2 1 268 265 269 ,"
"PReLU 270 1 1 269 270 1 0 ,"
"Convolution 271 1 1 270 271 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 272 2 1 209 271 272 ,"
"Upsample 300 1 1 272 300 1 0 0 0 16 16 ,"
"BatchNormCxx 303 1 1 300 303 ,"
"Upsample 321 1 1 input 321 1 0 0 0 16 16 ,"
"Convolution 322 1 1 321 322 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 323 1 1 322 323 ,"
"Convolution 327 1 1 323 327 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 325 1 1 323 325 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 328 2 1 303 327 328 ,"
"Add 329 2 1 328 325 329 ,"
"PReLU 330 1 1 329 330 1 0 ,"
"Convolution 334 1 1 330 334 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 352 1 1 input 352 1 0 0 0 16 16 ,"
"Convolution 353 1 1 352 353 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 354 1 1 353 354 ,"
"Convolution 358 1 1 354 358 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 356 1 1 354 356 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 359 2 1 334 358 359 ,"
"Add 360 2 1 359 356 360 ,"
"PReLU 361 1 1 360 361 1 0 ,"
"Convolution 362 1 1 361 362 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 363 2 1 300 362 363 ,"
"BatchNormCxx 366 1 1 363 366 ,"
"Upsample 384 1 1 input 384 1 0 0 0 16 16 ,"
"Convolution 385 1 1 384 385 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 386 1 1 385 386 ,"
"Convolution 390 1 1 386 390 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 388 1 1 386 388 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 391 2 1 366 390 391 ,"
"Add 392 2 1 391 388 392 ,"
"PReLU 393 1 1 392 393 1 0 ,"
"Convolution 397 1 1 393 397 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 415 1 1 input 415 1 0 0 0 16 16 ,"
"Convolution 416 1 1 415 416 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 417 1 1 416 417 ,"
"Convolution 421 1 1 417 421 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 419 1 1 417 419 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 422 2 1 397 421 422 ,"
"Add 423 2 1 422 419 423 ,"
"PReLU 424 1 1 423 424 1 0 ,"
"Convolution 425 1 1 424 425 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 426 2 1 363 425 426 ,"
"Upsample 454 1 1 426 454 1 0 0 0 32 32 ,"
"BatchNormCxx 457 1 1 454 457 ,"
"Upsample 475 1 1 input 475 1 0 0 0 32 32 ,"
"Convolution 476 1 1 475 476 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 477 1 1 476 477 ,"
"Convolution 481 1 1 477 481 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 479 1 1 477 479 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 482 2 1 457 481 482 ,"
"Add 483 2 1 482 479 483 ,"
"Convolution 484 1 1 483 484 1 128 64 1 1 1 1 0 0 0 -1 1 1 ,"
"BatchNormCxx 487 1 1 454 487 ,"
"Upsample 505 1 1 input 505 1 0 0 0 32 32 ,"
"Convolution 506 1 1 505 506 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 507 1 1 506 507 ,"
"Convolution 511 1 1 507 511 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 509 1 1 507 509 1 128 128 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 512 2 1 487 511 512 ,"
"Add 513 2 1 512 509 513 ,"
"PReLU 514 1 1 513 514 1 0 ,"
"Convolution 518 1 1 514 518 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 536 1 1 input 536 1 0 0 0 32 32 ,"
"Convolution 537 1 1 536 537 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 538 1 1 537 538 ,"
"Convolution 542 1 1 538 542 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 540 1 1 538 540 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 543 2 1 518 542 543 ,"
"Add 544 2 1 543 540 544 ,"
"PReLU 545 1 1 544 545 1 0 ,"
"Convolution 546 1 1 545 546 1 64 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 547 2 1 484 546 547 ,"
"Upsample 575 1 1 547 575 1 0 0 0 64 64 ,"
"BatchNormCxx 578 1 1 575 578 ,"
"Upsample 596 1 1 input 596 1 0 0 0 64 64 ,"
"Convolution 597 1 1 596 597 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 598 1 1 597 598 ,"
"Convolution 602 1 1 598 602 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 600 1 1 598 600 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 603 2 1 578 602 603 ,"
"Add 604 2 1 603 600 604 ,"
"Convolution 605 1 1 604 605 1 64 32 1 1 1 1 0 0 0 -1 1 1 ,"
"BatchNormCxx 608 1 1 575 608 ,"
"Upsample 626 1 1 input 626 1 0 0 0 64 64 ,"
"Convolution 627 1 1 626 627 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 628 1 1 627 628 ,"
"Convolution 632 1 1 628 632 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 630 1 1 628 630 1 128 64 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 633 2 1 608 632 633 ,"
"Add 634 2 1 633 630 634 ,"
"PReLU 635 1 1 634 635 1 0 ,"
"Convolution 639 1 1 635 639 1 64 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 657 1 1 input 657 1 0 0 0 64 64 ,"
"Convolution 658 1 1 657 658 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 659 1 1 658 659 ,"
"Convolution 663 1 1 659 663 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 661 1 1 659 661 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 664 2 1 639 663 664 ,"
"Add 665 2 1 664 661 665 ,"
"PReLU 666 1 1 665 666 1 0 ,"
"Convolution 667 1 1 666 667 1 32 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 668 2 1 605 667 668 ,"
"Upsample 696 1 1 668 696 1 0 0 0 128 128 ,"
"BatchNormCxx 699 1 1 696 699 ,"
"Upsample 717 1 1 input 717 1 0 0 0 128 128 ,"
"Convolution 718 1 1 717 718 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 719 1 1 718 719 ,"
"Convolution 723 1 1 719 723 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 721 1 1 719 721 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 724 2 1 699 723 724 ,"
"Add 725 2 1 724 721 725 ,"
"Convolution 726 1 1 725 726 1 32 16 1 1 1 1 0 0 0 -1 1 1 ,"
"BatchNormCxx 729 1 1 696 729 ,"
"Upsample 747 1 1 input 747 1 0 0 0 128 128 ,"
"Convolution 748 1 1 747 748 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 749 1 1 748 749 ,"
"Convolution 753 1 1 749 753 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 751 1 1 749 751 1 128 32 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 754 2 1 729 753 754 ,"
"Add 755 2 1 754 751 755 ,"
"PReLU 756 1 1 755 756 1 0 ,"
"Convolution 760 1 1 756 760 1 32 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 778 1 1 input 778 1 0 0 0 128 128 ,"
"Convolution 779 1 1 778 779 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 780 1 1 779 780 ,"
"Convolution 784 1 1 780 784 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 782 1 1 780 782 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 785 2 1 760 784 785 ,"
"Add 786 2 1 785 782 786 ,"
"PReLU 787 1 1 786 787 1 0 ,"
"Convolution 788 1 1 787 788 1 16 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 789 2 1 726 788 789 ,"
"Upsample 817 1 1 789 817 1 0 0 0 256 256 ,"
"BatchNormCxx 820 1 1 817 820 ,"
"Upsample 838 1 1 input 838 1 0 0 0 256 256 ,"
"Convolution 839 1 1 838 839 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 840 1 1 839 840 ,"
"Convolution 844 1 1 840 844 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 842 1 1 840 842 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 845 2 1 820 844 845 ,"
"Add 846 2 1 845 842 846 ,"
"Convolution 847 1 1 846 847 1 16 8 1 1 1 1 0 0 0 -1 1 1 ,"
"BatchNormCxx 850 1 1 817 850 ,"
"Upsample 868 1 1 input 868 1 0 0 0 256 256 ,"
"Convolution 869 1 1 868 869 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 870 1 1 869 870 ,"
"Convolution 874 1 1 870 874 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 872 1 1 870 872 1 128 16 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 875 2 1 850 874 875 ,"
"Add 876 2 1 875 872 876 ,"
"PReLU 877 1 1 876 877 1 0 ,"
"Convolution 881 1 1 877 881 1 16 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Upsample 899 1 1 input 899 1 0 0 0 256 256 ,"
"Convolution 900 1 1 899 900 1 3 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU 901 1 1 900 901 ,"
"Convolution 905 1 1 901 905 1 128 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Convolution 903 1 1 901 903 1 128 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Mul 906 2 1 881 905 906 ,"
"Add 907 2 1 906 903 907 ,"
"PReLU 908 1 1 907 908 1 0 ,"
"Convolution 909 1 1 908 909 1 8 8 3 3 1 1 1 1 1 -1 1 1 ,"
"Add 910 2 1 847 909 910 ,"
"PReLU 911 1 1 910 911 1 0 ,"
"Convolution 912 1 1 911 912 1 8 3 3 3 1 1 1 1 1 -1 1 1 ,"
"Tanh output 1 1 912 output ,"
